# GetRegisteredUpdaterInfos Method (Document)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterRegistry..::..GetRegisteredUpdaterInfos Method (Document)
UpdaterRegistry Class See Also
---
Returns information about all updaters applicable to the given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static IList<UpdaterInfo> GetRegisteredUpdaterInfos(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetRegisteredUpdaterInfos ( _
	document As Document _
) As IList(Of UpdaterInfo)
```

Visual C++
---
```text
public:
static IList<UpdaterInfo^>^ GetRegisteredUpdaterInfos(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document to which sought updaters are applicable to.
# ### Return Value
List of UpdaterInfo structures
# Remarks
The list of data includes information about all updaters explicitly registered for the document as well as information about all application-wide registered updaters (which are applicable to all documents).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UpdaterRegistry Class
GetRegisteredUpdaterInfos Overload
Autodesk.Revit.DB Namespace